echo-load.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="warning">
  <clients>
    <client host="tsung0" cpu="2" use_controller_vm="false" maxusers="50000" />
    <client host="tsung1" cpu="2" use_controller_vm="false" maxusers="50000" />
    <client host="tsung2" cpu="2" use_controller_vm="false" maxusers="50000" />
    <client host="tsung3" cpu="2" use_controller_vm="false" maxusers="50000" />
    <client host="tsung4" cpu="2" use_controller_vm="false" maxusers="50000" />
    <client host="tsung5" cpu="2" use_controller_vm="false" maxusers="50000" />
    <client host="tsung6" cpu="2" use_controller_vm="false" maxusers="50000" />
    <client host="tsung7" cpu="2" use_controller_vm="false" maxusers="50000" />
    <client host="tsung8" cpu="2" use_controller_vm="false" maxusers="50000" />
    <client host="tsung9" cpu="2" use_controller_vm="false" maxusers="50000" />
    <client host="tsung10" cpu="2" use_controller_vm="false" maxusers="50000" />
    <client host="tsung11" cpu="2" use_controller_vm="false" maxusers="50000" />
    <client host="tsung12" cpu="2" use_controller_vm="false" maxusers="50000" />
    <client host="tsung13" cpu="2" use_controller_vm="false" maxusers="50000" />
    <client host="tsung14" cpu="2" use_controller_vm="false" maxusers="50000" />
    <client host="tsung15" cpu="2" use_controller_vm="false" maxusers="50000" />
    <client host="tsung16" cpu="2" use_controller_vm="false" maxusers="50000" />
    <client host="tsung17" cpu="2" use_controller_vm="false" maxusers="50000" />
    <client host="tsung18" cpu="2" use_controller_vm="false" maxusers="50000" />
    <client host="tsung19" cpu="2" use_controller_vm="false" maxusers="50000" />
  </clients>

  <servers>
    <server host="server" port="4000" type="tcp" />
  </servers>

  <load>
    <arrivalphase phase="1" duration="15" unit="minute">
      <users maxnumber="1000000" arrivalrate="5000" unit="second" />
    </arrivalphase>
  </load>

  <options>
    <option name="ports_range" min="1025" max="65535"/>
  </options>

  <sessions>
    <session name="websocket" probability="100" type="ts_websocket">
      <request>
        <websocket type="connect" path="/socket/websocket"></websocket>
      </request>

      <request>
        <websocket type="message">{"topic":"rooms:lobby", "event":"phx_join", "payload": {}, "ref":"1"}</websocket>
      </request>
      <thinktime value="300"/>

      <for var="i" from="1" to="1000" incr="1">
        <thinktime value="10"/>
        <request>
          <websocket type="message">{"topic":"rooms:lobby","event":"new:msg","payload":{"body":"hello world"},"ref":"2"}</websocket>
        </request>
      </for>
    </session>
  </sessions>
</tsung>